app/views/groups/index.html.erb

        <td>
            <h2><%= link_to(group.group_name, group) %><%= " (#{group.group_members.length})" %></h2>
---
SELECT "groups".* FROM "groups"