app/views/home/profile.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 12]]
---
	<h2>Próximos eventos</h2>
	<% current_user = User.find(session[:user_id]) %>