app/views/pictures/index.html.erb

SELECT "pictures".* FROM "pictures"
---
<table>
  <% count = @event.pictures.length-1 %>