app/controllers/events_controller.rb

  def edit
    @event = Event.find(params[:id])
---
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @event = Event.new(params[:event])

    respond_to do |format|
      if @event.save
---
INSERT INTO "events" ("created_at", "date", "description", "is_private", "name", "place", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)