app/controllers/event_comments_controller.rb

SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "event_comments" ("comment", "created_at", "event_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["comment", "adadasd"], ["created_at", Thu, 03 May 2012 15:21:37 UTC +00:00], ["event_id", 1], ["updated_at", Thu, 03 May 2012 15:21:37 UTC +00:00], ["user_id", nil]]
---
	def create
	    @event = Event.find(params[:event_id])
	    @event_comment = @event.event_comments.create(params[:event_comment])