app/controllers/groups_controller.rb

  def index
    @groups = Group.all
---
SELECT "groups".* FROM "groups"

  def show
    @group = Group.find(params[:id])
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @group = Group.new(params[:group])
    @group.user_id = session[:user_id]

    respond_to do |format|
      if @group.save
---
INSERT INTO "groups" ("created_at", "group_name", "updated_at") VALUES (?, ?, ?)  [["created_at", Fri, 20 Apr 2012 19:10:24 UTC +00:00], ["group_name", "Los Fito"], ["updated_at", Fri, 20 Apr 2012 19:10:24 UTC +00:00]]