app/controllers/home_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 12]]
SELECT "user_events".* FROM "user_events" WHERE "user_events"."user_id" = 12
---
  def profile
  	@user = User.find(session[:user_id])

    news_size = 4;
    @last_updates = Array.new
    events = @user.events

    e = 0
    while @last_updates.length<5 && e<events.length do