app/controllers/pictures_controller.rb

SELECT "pictures".* FROM "pictures"
---
  def index
    @pictures = Picture.all

SELECT "pictures".* FROM "pictures" WHERE "pictures"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @picture = Picture.find(params[:id])

INSERT INTO "pictures" ("created_at", "description", "name", "path", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @picture = Picture.new(Picture.picture_upload(params)[:picture])

    respond_to do |format|
      if @picture.save

SELECT "pictures".* FROM "pictures" WHERE "pictures"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "pictures" WHERE "pictures"."id" = ?  [["id", 1]]
---
  def destroy
    @picture = Picture.find(params[:id])
    @event = Event.find(@picture.event.id)
    @picture.destroy