app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "facebook", "password", "twitter", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Sun, 22 Apr 2012 20:45:54 UTC +00:00], ["email", "camolin3@uc.cl"], ["facebook", nil], ["password", "uno"], ["twitter", nil], ["updated_at", Sun, 22 Apr 2012 20:45:54 UTC +00:00]]
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "14"]]
UPDATE "users" SET "password" = 'wachon68', "updated_at" = '2012-05-02 15:04:11.018877' WHERE "users"."id" = 14
---
  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])